Revit 2024 API
GroupTypeId.WallCrossSectionDefinition Property
 Cross-Section Definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId WallCrossSectionDefinition { get; }
Visual Basic
Public Shared ReadOnly Property WallCrossSectionDefinition As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallCrossSectionDefinition {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace